# 05. DheerajKumar97/Employee-Salary-Prediction----python--ML

## Exploratory Data Analysis - test.csv

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")
pd.options.display.max_columns = 30
df = pd.read_csv("05_test.csv")

In [2]:
# First 5 rows of the dataset
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [3]:
# Last 5 rows of the dataset
df.tail()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
233594,1006036,P00118942,F,26-35,15,B,4+,1,8,NaN,NaN
233595,1006036,P00254642,F,26-35,15,B,4+,1,5,8.0,NaN
233596,1006036,P00031842,F,26-35,15,B,4+,1,1,5.0,12.0
233597,1006037,P00124742,F,46-50,1,C,4+,0,10,16.0,NaN
233598,1006039,P00316642,F,46-50,0,B,4+,1,4,5.0,NaN

In [4]:
# All columns, their counts and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233599 entries, 0 to 233598
Data columns (total 11 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     233599 non-null  int64
 1   Product_ID                  233599 non-null  object
 2   Gender                      233599 non-null  object
 3   Age                         233599 non-null  object
 4   Occupation                  233599 non-null  int64
 5   City_Category               233599 non-null  object
 6   Stay_In_Current_City_Years  233599 non-null  object
 7   Marital_Status              233599 non-null  int64
 8   Product_Category_1          233599 non-null  int64
 9   Product_Category_2          161255 non-null  float64
 10  Product_Category_3          71037 non-null   float64
dtypes: float64(2), int64(4), object(5)
memory usage: 19.6+ MB

In [5]:
# Get statistical info about numerical columns (except UserID)
df.drop('User_ID',axis=1).describe()

,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
count,233599.000000,233599.000000,233599.000000,161255.000000,71037.000000
mean,8.085407,0.410070,5.276542,9.849586,12.669454
std,6.521146,0.491847,3.736380,5.094943,4.125944
min,0.000000,0.000000,1.000000,2.000000,3.000000
25%,2.000000,0.000000,1.000000,5.000000,9.000000
50%,7.000000,0.000000,5.000000,9.000000,14.000000
75%,14.000000,1.000000,8.000000,15.000000,16.000000
max,20.000000,1.000000,18.000000,18.000000,18.000000

In [6]:
# Get the counts of gender
df['Gender'].value_counts()

M    175772
F     57827
Name: Gender, dtype: int64

In [7]:
# Get the counts of age ranges
df['Age'].value_counts()

26-35    93428
36-45    46711
18-25    42293
46-50    19577
51-55    16283
55+       9075
0-17      6232
Name: Age, dtype: int64

In [8]:
# Get the counts of occupations in descending order
print("As seen below, there are {} different occupations.".format(df['Occupation'].nunique()))
df['Occupation'].value_counts()

As seen below, there are 21 different occupations.

4     30778
0     29212
7     24994
1     20261
17    17375
20    14278
12    13269
14    11473
2     11408
16    10751
6      8747
3      7476
10     5374
5      5196
15     5191
11     5007
19     3458
13     3325
18     2745
9      2638
8       643
Name: Occupation, dtype: int64

In [9]:
# Get the counts of city categories
df['City_Category'].value_counts()

B    98566
C    72509
A    62524
Name: City_Category, dtype: int64

In [10]:
# Get the counts of current city years the person is staying
df['Stay_In_Current_City_Years'].value_counts()

1     82604
2     43589
3     40143
4+    35945
0     31318
Name: Stay_In_Current_City_Years, dtype: int64

In [11]:
# Get the counts of marital status (0 should mean 'single', 1 should mean 'married')
df['Marital_Status'].value_counts()

0    137807
1     95792
Name: Marital_Status, dtype: int64

In [12]:
# Get the counts of 1st Product Categories is descending order
print("{} different 1st Product Categories exist".format(df['Product_Category_1'].nunique()))
print("{} null values in 1st Product Category".format(df['Product_Category_1'].isnull().sum()))
df['Product_Category_1'].value_counts()

18 different 1st Product Categories exist
0 null values in 1st Product Category

5     65017
1     60321
8     48369
2     10192
11    10153
6      8860
3      8578
4      5003
16     4105
15     2694
13     2381
10     2248
12     1663
7      1624
18     1311
14      663
17      223
9       194
Name: Product_Category_1, dtype: int64

In [13]:
# Get the counts of 2nd Product Categories in descending order
print("{} different 2nd Product Categories exist".format(df['Product_Category_2'].nunique()))
print("{} null values in 2nd Product Category".format(df['Product_Category_2'].isnull().sum(), ))
df['Product_Category_2'].value_counts()

17 different 2nd Product Categories exist
72344 null values in 2nd Product Category

8.0     27229
14.0    23726
2.0     21281
16.0    18432
15.0    16259
4.0     11028
5.0     10930
6.0      7109
11.0     6096
17.0     5784
13.0     4523
9.0      2484
12.0     2273
10.0     1377
18.0     1257
3.0      1239
7.0       228
Name: Product_Category_2, dtype: int64

In [14]:
print("{} different 3rd Product Categories exist".format(df['Product_Category_3'].nunique()))
print("{} null values in 3rd Product Category".format(df['Product_Category_3'].isnull().sum()))
df['Product_Category_3'].value_counts()

15 different 3rd Product Categories exist
162562 null values in 3rd Product Category

16.0    13833
15.0    11955
14.0     7855
5.0      7141
17.0     7116
8.0      5299
9.0      4953
12.0     3869
13.0     2390
6.0      1998
18.0     1992
4.0       816
11.0      780
10.0      775
3.0       265
Name: Product_Category_3, dtype: int64

Since `Purchase` is not available in the test set, no visualization was created here.